import React from 'react';

let Company = (props) => {
    return (
      <div className="CompanyContainer" style={props.divStyle}>
        
        <div className='Company'>
            <div className='CompanyInfo'>
                <h1>О компании</h1>
                <h4>Архитектура Комфорта — это надежный партнер в сфере строительства домов, который предлагает полный спектр услуг по проектированию и возведению жилых и коммерческих объектов. Наша команда состоит из опытных специалистов, которые обладают глубокими знаниями и навыками в области строительства, архитектуры и дизайна. Мы стремимся к высокому качеству работы и индивидуальному подходу к каждому клиенту, что позволяет нам успешно реализовывать проекты любой сложности.
                С момента своего основания, Архитектура Комфорта зарекомендовала себя как надежный и ответственный подрядчик, который ценит доверие своих клиентов. Мы используем только современные технологии и качественные материалы, что гарантирует долговечность и надежность построенных объектов.
                </h4>
            </div>

            <div className='CompanyHistory'>
                <h1>История компании</h1>
                <h4>Архитектура Комфорта — это надежный партнер в сфере строительства домов, который предлагает полный спектр услуг по проектированию и возведению жилых и коммерческих объектов. Наша команда состоит из опытных специалистов, которые обладают глубокими знаниями и навыками в области строительства, архитектуры и дизайна. Мы стремимся к высокому качеству работы и индивидуальному подходу к каждому клиенту, что позволяет нам успешно реализовывать проекты любой сложности.
                С момента своего основания, Архитектура Комфорта зарекомендовала себя как надежный и ответственный подрядчик, который ценит доверие своих клиентов. Мы используем только современные технологии и качественные материалы, что гарантирует долговечность и надежность построенных объектов.</h4>
            </div>

            <div className='CompanyCommand'>
                <h1>Наша команда</h1>
                <h4>В команде компании работают высококвалифицированные специалисты, включая архитекторов, инженеров и строителей с многолетним опытом.
                Компания активно инвестирует в обучение и развитие своих сотрудников, что позволяет поддерживать высокий уровень профессионализма.
                Руководство компании состоит из опытных менеджеров, которые имеют успешный опыт работы в строительной отрасли и управлении проектами.</h4>
            </div>
        </div>
        
       <div className='InfoOfMission'>
        <div className='Mission'>
          <h2>Миссия</h2>
          <h4>Миссия компании "Атмосфера комфорта" заключается в создании комфортных и безопасных пространств для жизни и работы, где каждый клиент чувствует заботу и внимание к своим потребностям.</h4>
        </div>

        <div className='Mission'>
          <h2>Ценности</h2>
          <h4>высокое качество услуг, индивидуальный подход к каждому клиенту, инновации в строительстве, устойчивое развитие и заботу об экологии.</h4>
        </div>

        <div className='Mission'>
          <h2>Качество</h2>
          <h4>Мы стремимся предоставлять услуги наивысшего качества, используя только лучшие материалы и технологии.</h4>
        </div>

        <div className='Mission'>
          <h2>Качество</h2>
          <h4>Мы стремимся предоставлять услуги наивысшего качества, используя только лучшие материалы и технологии.</h4>
        </div>

        <div className='Mission'>
          <h2>Индивидуальный подход</h2>
          <h4>Каждый проект уникален, и мы учитываем все пожелания и требования наших клиентов.</h4>
        </div>

        <div className='Mission'>
          <h2>Инновации</h2>
          <h4>Мы постоянно ищем новые решения и технологии, чтобы улучшить наши услуги и повысить эффективность работы.</h4>
        </div>

        <div className='Mission'>
          <h2>Устойчивое развитие</h2>
          <h4>Мы заботимся о будущем планеты, используя экологически чистые материалы и практики.</h4>
        </div>

        <div className='Mission'>
          <h2>Командная работа</h2>
          <h4>Мы верим в силу команды и ценим вклад каждого сотрудника, создавая атмосферу сотрудничества и поддержки.</h4>
        </div>
      </div>
      </div>
    );
  }
  
  export default Company;